// Напишите программу, которая принимает на вход трёхзначное число и 
// на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

Console.Clear();
Console.Write("Введите число трехзначное число: ");
int Number = int.Parse(Console.ReadLine());
int a = Number % 100;
int a1 = a/10;
if (Number<100||Number >=1000)
{Console.WriteLine("Введено не трехзначное число");
}
    Console.WriteLine($"Последнее число трезначного значения ({a1})");